"""Свойства смазочных материалов."""

MINERAL_OIL = {
    "name": "Минеральное (SAE 10W-40)",
    "eta_diesel": 0.010,  # рабочая для ДВС (105°C), Па·с
    "eta_pump": 0.022,    # рабочая для насоса (50°C), Па·с
    "rho": 875,
    "alpha_pv": 18e-9,    # коэффициент Баруса (Па⁻¹)
}

RAPESEED_OIL = {
    "name": "Рапсовое биомасло (HO)",
    "eta_diesel": 0.008,  # рабочая для ДВС (105°C), Па·с
    "eta_pump": 0.025,    # рабочая для насоса (50°C), Па·с
    "rho": 915,
    "alpha_pv": 12e-9,    # коэффициент Баруса (Па⁻¹)
}
